TexasInstruments/mcupsdk-core/examples/drivers/boot/sbl_ospi_enet/am263px-cc/r5fss0-0_nortos/example.syscfg
section4.load_memory                              = "MSRAM_0";
section4.$name                                    = "Stack Segments";
section4.output_section.create(5);
section4.output_section[0].$name                  = ".irqstack";
section4.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section4.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section4.output_section[0].input_section.create(1);
section4.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section4.output_section[1].$name                  = ".fiqstack";
section4.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section4.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section4.output_section[1].input_section.create(1);
section4.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section4.output_section[2].$name                  = ".svcstack";
section4.output_section[2].output_sections_start  = "__SVC_STACK_START";
section4.output_section[2].output_sections_end    = "__SVC_STACK_END";
section4.output_section[2].input_section.create(1);
section4.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section4.output_section[3].$name                  = ".abortstack";
section4.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section4.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section4.output_section[3].input_section.create(1);
section4.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section4.output_section[4].$name                  = ".undefinedstack";
section4.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section4.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section4.output_section[4].input_section.create(1);
section4.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section5.load_memory             = "MSRAM_HSMRT";
section5.group                   = false;
section5.$name                   = "Hsmrt";
section5.output_section.create(1);
section5.output_section[0].$name = ".rodata.hsmrt";

section6.load_memory                 = "MAILBOX_HSM";
section6.type                        = "NOLOAD";
section6.group                       = false;
section6.$name                       = "SIPC HSM Queue Memory";
section6.output_section.create(1);
section6.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section6.output_section[0].alignment = 0;

section7.load_memory                 = "MAILBOX_R5F";
section7.type                        = "NOLOAD";
section7.group                       = false;
section7.$name                       = "SIPC R5F Queue Memory";
section7.output_section.create(1);
section7.output_section[0].$name     = ".bss.sipc_secure_host_queue_mem";
section7.output_section[0].alignment = 0;

section8.$name                       = "NDK Packet Memory ENET_CPPI_DESC";
section8.type                        = "NOLOAD";
section8.group                       = false;
section8.load_memory                 = "CPPI_DESC";
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss:ENET_CPPI_DESC";
section8.output_section[0].alignment = 128;

section9.$name                   = "File Buffer to be flashed";
section9.type                    = "NOLOAD";
section9.group                   = false;
section9.load_memory             = "MSRAM_1";
section9.output_section.create(1);
section9.output_section[0].$name = ".bss.filebuf";

section10.$name                   = "Scratch pad memory";
section10.type                    = "NOLOAD";
section10.group                   = false;
section10.load_memory             = "MSRAM_2";
section10.output_section.create(1);
section10.output_section[0].$name = ".bss.sbl_scratch";

enet_cpsw1.$name                        = "CONFIG_ENET_CPSW0";
enet_cpsw1.DisableMacPort1              = true;
enet_cpsw1.RtosVariant                  = "NoRTOS";
enet_cpsw1.macAddrConfig                = "Manual Entry";
enet_cpsw1.cptsHostRxTsEn               = false;
enet_cpsw1.RGMII2.RD0.$used             = false;
enet_cpsw1.RGMII2.RD1.$used             = false;
enet_cpsw1.RGMII2.RD2.$used             = false;
enet_cpsw1.RGMII2.RD3.$used             = false;
enet_cpsw1.RGMII2.RX_CTL.$used          = false;
enet_cpsw1.RGMII2.RXC.$used             = false;
enet_cpsw1.RGMII2.TD0.$used             = false;
enet_cpsw1.RGMII2.TD1.$used             = false;
enet_cpsw1.RGMII2.TD2.$used             = false;
enet_cpsw1.RGMII2.TD3.$used             = false;
enet_cpsw1.RGMII2.TX_CTL.$used          = false;
enet_cpsw1.RGMII2.TXC.$used             = false;
enet_cpsw1.txDmaChannel[0].$name        = "ENET_DMA_TX_CH0";
enet_cpsw1.txDmaChannel[0].PacketsCount = 8;
enet_cpsw1.rxDmaChannel[0].$name        = "ENET_DMA_RX_CH0";
enet_cpsw1.rxDmaChannel[0].PacketsCount = 8;

const ethphy_cpsw_icssg  = scripting.addModule("/board/ethphy_cpsw_icssg/ethphy_cpsw_icssg", {}, false);
const ethphy_cpsw_icssg1 = ethphy_cpsw_icssg.addInstance({}, false);
ethphy_cpsw_icssg1.$name = "CONFIG_ENET_ETHPHY1";
enet_cpsw1.ethphy2       = ethphy_cpsw_icssg1;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.$suggestSolution = "OSPI0";
i2c2.I2C.SCL.$suggestSolution                 = "I2C0_SCL";
i2c2.I2C.SDA.$suggestSolution                 = "I2C0_SDA";
debug_log.uartLog.UART.$suggestSolution       = "UART0";
enet_cpsw1.MDIO.$suggestSolution              = "MDIO";
enet_cpsw1.MDIO.MDC.$suggestSolution          = "MDIO_MDC";
enet_cpsw1.MDIO.MDIO.$suggestSolution         = "MDIO_MDIO";
enet_cpsw1.RGMII1.$suggestSolution            = "RGMII2";
enet_cpsw1.RGMII1.RD0.$suggestSolution        = "PR0_PRU0_GPIO0";
enet_cpsw1.RGMII1.RD1.$suggestSolution        = "PR0_PRU0_GPIO1";
enet_cpsw1.RGMII1.RD2.$suggestSolution        = "PR0_PRU0_GPIO2";
enet_cpsw1.RGMII1.RD3.$suggestSolution        = "PR0_PRU0_GPIO3";
enet_cpsw1.RGMII1.RX_CTL.$suggestSolution     = "PR0_PRU0_GPIO4";
enet_cpsw1.RGMII1.RXC.$suggestSolution        = "PR0_PRU0_GPIO6";
enet_cpsw1.RGMII1.TD0.$suggestSolution        = "PR0_PRU0_GPIO11";
enet_cpsw1.RGMII1.TD1.$suggestSolution        = "PR0_PRU0_GPIO12";
enet_cpsw1.RGMII1.TD2.$suggestSolution        = "PR0_PRU0_GPIO13";
enet_cpsw1.RGMII1.TD3.$suggestSolution        = "PR0_PRU0_GPIO14";
enet_cpsw1.RGMII1.TX_CTL.$suggestSolution     = "PR0_PRU0_GPIO15";
enet_cpsw1.RGMII1.TXC.$suggestSolution        = "PR0_PRU0_GPIO16";
enet_cpsw1.RGMII2.$suggestSolution            = "RGMII1";
